In [6]:
import pandas as pd

In [10]:
df = pd.DataFrame({
"Name": ['a','b','c','d'],
 "age": [3,5,7,9,],
 "Sex": ["M","F","M","M"]
})
df

  Name  age Sex
0    a    3   M
1    b    5   F
2    c    7   M
3    d    9   M

In [11]:
import matplotlib.pyplot as plt

In [14]:
df['age']

0    3
1    5
2    7
3    9
Name: age, dtype: int64

In [15]:
df['age'].max()

9

In [16]:
df.describe()

            age
count  4.000000
mean   6.000000
std    2.581989
min    3.000000
25%    4.500000
50%    6.000000
75%    7.500000
max    9.000000

In [17]:
df

  Name  age Sex
0    a    3   M
1    b    5   F
2    c    7   M
3    d    9   M

In [18]:
df.describe()

            age
count  4.000000
mean   6.000000
std    2.581989
min    3.000000
25%    4.500000
50%    6.000000
75%    7.500000
max    9.000000

In [20]:
Years = [y for y in range(1991,2000)]
Years

[1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999]